docs/api/trigger_run_parameters.md
```mermaid
sequenceDiagram
    actor user as User
    participant api as API
    participant orchestrator as Orchestrator
    participant checkWorker as Parameter check worker
    participant configManager as Config file manager
    participant script as Parameter validation script

    user ->> api: trigger run
    api ->> user: accepted
    destroy api
    api ->> orchestrator: forward
    orchestrator ->> checkWorker: runId
    checkWorker ->> checkWorker: load parameters
    checkWorker ->> configManager: getFile
    destroy configManager
    configManager ->> checkWorker: parameter config script
    checkWorker ->> script: run on parameters
    destroy script
    script ->> checkWorker: (mapped parameters, issues)
    checkWorker ->> checkWorker: save mapped parameters
    destroy checkWorker
    checkWorker ->> orchestrator: check result
    orchestrator ->> orchestrator: start next worker
```
